[
  [
    "Howdy.",
    "Hello.",
    "Hi.",
    "Hello there.",
    "Hey.",
    "Sup.",
    "Hello there.",
    "*coughing*\n*(no not the pandemic smh my socks)*",
    "*ahem* Hi.",
    "Is anyone else getting hungry?",
    "*yawning*",
    "I swear I heard a tap.",
    "Hey, {0.author.name}."
  ],
  [
    "See you later.",
    "Goodbye.",
    "Bye.",
    "Sayonara.",
    "Later.",
    "Bye...",
    "Well, uh, see you later.. or never.",
    "See ya.",
    "Bye-bye.",
    "Well, see you later.",
    "See you later, {0.author.name}"
  ],
  [
    "Freaking hell, did I just hear a table fall.",
    "Okay, who made the table fall.",
    "Oh come on, {0.author}, you know better.",
    "Who the hell?",
    "Oh, don't do that again please..",
    "oh god dammit **if I hear you flipping that god damn table again I swear...**",
    "Ow!",
    "Hey, that almost hit me!",
    "OY!",
    "I hope you freaking hit your toe for doing that."
  ],
  [
    "Man, this is quiet.",
    "Hello? Anyone there?",
    "It's a bit *too* quiet...",
    "It's way too quiet..",
    "Huh? Is someone there?",
    "Hello..?",
    "Is anyone here, or is this chat just silent?",
    "Soo... how was your day?",
    "No, I'm not sentient.",
    "Is anyone else getting hungry?",
    "*yawn*",
    "This is eerily quiet, it's kinda scary..",
    "Hello? Anyone.. there...?",
    "Hey, it sounds like there's a fire somewhere..",
    "┬─┬ ノ( ゜-゜ノ)",
    "Who left this open?",
    "Ooh, a dollar bill!",
    "Oh look, a penny.",
    "It's quiet, almost too quiet...\n*bangs a bunch of pots and pans together*",
    "**HONK**",
    "Oh no, stairs! I can't climb stairs! Nooo!",
    "I'm over here!"
  ],
  "My prefix here is `{0}`.",
  "Hey, you said something you were not supposed to say! Unfortunately for me (and probably fortunately for you), I don't have the permissions to delete your message.",
  "Sorry, I do not have the permissions to do that.",
  "Uh oh! I ran into an error.\nBecause this server's configuration doesn't allow me to automatically save errors, you'll have to do it yourself.",

  "Huh?",
  "Pong!\nIt took me {0}ms.",
  [
    "It is certain.",
    "It is decidedly so.",
    "Without a doubt",
    "Yes - definitely.",
    "You may rely on it.",
    "As I see it, yes.",
    "Most likely.",
    "Outlook good.",
    "Yes.",
    "Signs point to yes.",
    "Reply hazy, try again.",
    "Ask again later.",
    "Better not tell you now.",
    "Cannot predict now.",
    "Concentrate and ask again.",
    "Don't count on it.",
    "My reply is no.",
    "My sources say no.",
    "Outlook not so good.",
    "Very doubtful."
  ],
  "Hey, I can't send literally nothing.",
  "What would you like to owofy?",
  "Uh oh, the text is over 2000 characters long, which is the maximum number of characters allowed in a message. *(Current length is {0}, action cancelled)*",
  "What would you like the title to be?",
  "Uh oh, the title's length is higher than 256! Maximum length allowed is 256. *(Requested title's length is {0}, action cancelled.)*",
  "What would you like the description to be?",
  "No lyrics available",
  "Could not find that artist. *Sorry.*",
  "Insert either an artist's name or a song, otherwise I can't work with literally nothing!",
  "*{0}* by *{1}*",

  "What would you like to set as the prefix for this server?",
  "The prefix is longer than one character long. You can only have one character as your prefix.\n*Requested prefix's length is {0}*",
  "Are you sure you want to set `{0}` as your new server prefix?\nExample: `{0}help`",
  "Hey wait a second, that's the same prefix as the current saved one! *(Action cancelled. Not like it'd change anything if it weren't cancelled...)*",
  "Successfully changed server prefix.",
  "Alright, action cancelled.",
  "I have no idea what that means. *Action cancelled.*",
  "{0}, you don't have the permissions to do that.\n*({1} Action cancelled)*",
  "Success, inactivity function is now turned off.",
  "Success, inactivity function is now turned on.",
  "Which word would you like to ban?",
  "Success, this word has been unbanned.",
  "Success, this word has been banned.",
  "What channel would you like to toggle?",
  "Uh oh, I could not get the channel you meant. Please try again. If it still fails, please try directly inserting the channel's ID. *Action cancelled.*",
  "Whoops, I couldn't find the channel you meant. Please try again by directly mentioning the channel you mean. *Action cancelled.*",
  "Are you sure you want to remove <#{0}> from the inactivity channels?",
  "Are you sure you want to add <#{0}> from the inactivity channels?",
  "Successfully removed <#{0}> from the inactivity channels.",
  "Successfully added <#{0}> to the inactivity channels.",
  "Which role would you like to set the mute role as?",
  "Uh oh, I could not get the role you meant. Please try again. If it still fails, please try directly inserting the role's ID. *Action cancelled.*",
  "Whoops, I couldn't find the role you meant. Please try again by directly mentioning the role you mean. *Action cancelled.*",
  "Hey wait a second, that's the role that has already been defined as the mute role! *Action cancelled. I mean, it wouldn't change anything if it weren't cancelled...*",
  "Are you sure you want to set {0} as the mute role?",
  "Successfully set {0} as the muted role",
  "Success, anonymous error logs will no longer be automatically sent to the bot host.",
  "Success, anonymous error logs will now be automatically sent to the bot host.",
  "Success, inactivity function is now turned off.",
  "Success, inactivity function is now turned on.",
  "Success, tableflip reactions are now turned off.",
  "Success, tableflip reactions are now turned on.",
  "Which command would you like to disable?",
  "I could not find that command. *Action cancelled.*",
  "Uh, are you *sure* you want to toggle the help command?",
  "Success, this command is now enabled.",
  "Success, this command is now disabled.",
  "Which category would you like to disable?",
  "I could not find that cog. *Action cancelled.*\n*Tip: This command is case sensitive, make sure your category is capitalized correctly.*",
  "Success, this cog is now enabled.",
  "Success, this cog is now disabled.",

  "Invalid amount specified: you can't put a number under 1! *Action cancelled.*",
  "{0}, are you sure you want to delete {1} messages?",
  "{0}, deleted {1} messages.",
  "I have found no rules for this server.",
  "{0}, you specified an invalid rule.",
  "{0}, you did not specify a rule.",
  "What shall be the rule description?",
  "Success, rule has been added.",
  "There are no rules for this server.",
  "The specified rule does not exist.",
  "Success, rule has been deleted.",
  "Really..? After all my efforts, this is how I get treated?",
  "You hate yourself *that* much?",
  "The specified user has the \"Manage Messages\" permission (or higher) inside the guild/server.",
  "You did not specify a user to kick. *Action cancelled.*",
  "You did not specify a user to ban. *Action cancelled.*",
  "Whoops, there seems to be more than one discriminator in that user. This is making my task of finding the user you are looking for impossible. *Action cancelled.*",
  "Whoops, I seem to have screwed something up (or Python is becoming unreliable), so now I can't find the user you are looking for. I guess I'll take the blame. *Action cancelled.*",
  "Hey, I'm not banned, I can still talk here.",
  "Yeah, you're not banned.",
  "You did not specify a user to unban. *Action cancelled.*",
  "Uh oh, I could not get the channel you meant. Please try again. If it still fails, please try directly inserting the channel's ID. *Action cancelled.*",
  "{0}, you did not specify a channel.",

  "The mute role hasn't been configured, please do so using the `muted_role` command. *Action cancelled.*",
  "{0}, relax. This user has already been muted for now.",
  "Whoops, the time you inputted could not be parsed. *Action cancelled.*",
  "You can't set the time as the past, that just isn't logical. *Action cancelled.*",
  "The time cannot be set as now. *Action cancelled.*",
  "{0}, you did not specify a valid user to mute. *({1} Action cancelled)*",
  "{0}, you did not specify the time until the user is unmuted. *({1} Action cancelled)*",
  "I couldn't find any mutes from this guild. *Action cancelled.*",
  "Current user ({0}) isn't muted.",
  "This server has no mutes. *Action cancelled.*",
  "User has been unmuted.",
  "{0}, you did not specify a user to unmute. *({1} Action cancelled)*",

  "You don't have anything. So, why not kick back and relax?",
  "I'd like to add stuff to your to-do list, but you gotta tell me *what* to add!",
  "Successfully added.",
  "I'd like to remove stuff from your to-do list, but you gotta tell me *what* to remove!",
  "You need to specify the **number** of the item in the list that you wish to remove!",
  "That item does not exist.",
  "Are you sure you want to remove this?",
  "Successfully removed.",
  "I'd like to edit stuff, but you gotta tell me *what* to modify!",
  "Are you sure you want to edit this?",
  "Successfully edited.",
  "You don't have the permissions to do that.",
  "You don't appear to be the author of that note, which means you cannot remove that note.",

  "It's useless to warn a bot. Why would you even try.",
  "{0}, you forgot to specify a user to warn.",
  "{0}, you forgot to specify a reason",
  "Please mention someone to verify their warns.",
  "That user does not have any warns.",
  "Wrong warn number, please try again.",
  "Are you sure you want to remove this warn?",
  "Successfully removed their warn.",
  "Please mention someone to remove their warns.",
  "What would you like to change the warn's reason to?",
  "Are you sure you want to edit this warn like this?",
  "Successfully edited their warn.",

  "Could not find what you're looking for.",
  "Uh oh, it appears that your rule file has been corrupted. This probably is the fault of the server's file storage, or that the programmer messed something up. It has been reset; sorry for any inconvenience.",

  "I'd like to edit this, but you gotta tell me *what* to modify it to!",
  "There's nothing in the guild's to-do list.",
  "{0}, you did not specify a valid user to check their mutes. *(Action cancelled)*",
  "{0} matches found, expected 1.",
  "Successfully done requested changes.",
  "No valid changes requested; none made.",
  "There currently are no temp-bans for this guild.",
  "That user is banned, however not temp-banned.",

  "Couldn't find that game on Steam.",
  "That game doesn't seem to have any reports on ProtonDB.",
  "**Linux seems to be natively supported**, according to Steam!",

  "Well, there are no pinned messages. I can't work with nothing.",
  "Do you also want me to delete the pinned messages?"
]