[
  [
    "Hé.",
    "Allô.",
    "Bonjour.",
    "Coucou.",
    "Hein?.",
    "Yo.",
    "*toussement*",
    "*ahem* Allô..",
    "Est-ce qu'il y a quelqu'un d'autre qui commence à avoir faim?",
    "*bâillement*",
    "Quoi?",
    "Hé, {0.author.name}."
  ],
  [
    "À plus tard.",
    "Bye.",
    "Au revoir.",
    "À plus.",
    "Au revoir...",
    "Alors, euh.. au revoir.",
    "À plus, {0.author.name}"
  ],
  [
    "Est-ce que je viens d'entendre une table tomber?",
    "D'accord, qui viens de lancer la table.",
    "Oh allez {0.author}, vraiment.",
    "Qui?",
    "Oh, ne refais pas ça..",
    "oh maudit **si je t'entends lancer une autre table...**",
    "Ouch!",
    "Hé, ça m'a presque frappé!",
    "Hey!"
  ],
  [
    "Hm, c'est silencieux ici.",
    "Allô? Il y a quelqu'un?",
    "C'est un peu *trop* silencieux.",
    "C'est beaucoup trop silencieux.",
    "Hein? Il y a quelqu'un?",
    "Allô..?",
    "Est-ce qu'il y a quelqu'un, ou est-ce que c'est juste silencieux?",
    "Alors... comment a été ta journée?",
    "Non, je ne suis pas vivant.",
    "Est-ce qu'il y a quelqu'un d'autre qui commence à avoir faim?",
    "Allô? Est-ce qu'il y a.. quelqu'un...?",
    "Hé, on dirait qu'il y a un feu à quelque part...",
    "┬─┬ ノ( ゜-゜ノ)",
    "Qui a laissé cette porte ouverte?"
  ],
  "Mon préfixe ici est `{0}`.",
  "Hé, tu viens de dire quelque chose que tu ne devais pas dire! Malheureusement pour moi (et probablement heureusement pour toi), je n'ai pas les permissions pour supprimer ton message.",
  "Je n'ai pas les permissions pour faire ça.",
  "Oh, oh. Il s'est passé une erreur.\nParce que ce serveur me dit de ne pas automatiquement envoyer les erreurs, il faudra que tu le fasses toi-même.",

  "Hein?",
  "Pong!\nCela m'a pris {0}ms.",
  [
    "C'est certain.",
    "Il en est décidément ainsi.",
    "Sans doute.",
    "Oui, définitivement.",
    "Tu peux y fier.",
    "Comme je le vois, oui.",
    "Probablement.",
    "Ça a l'air que oui.",
    "Oui.",
    "Les signes disent oui.",
    "Réponse brumeuse, réessayez.",
    "Redemandez plus tard.",
    "Mieux vaut ne pas te dire.",
    "Je ne peux pas le prédire maintenant.",
    "Concentre-toi et redemande.",
    "N'y compte pas.",
    "Ma réponse est non.",
    "Mes sources disent non.",
    "Ça a l'air que non.",
    "J'en suis très douteux."
  ],
  "Hé, je ne peux pas envoyer littéralement rien.",
  "Que voulez-vous owofyer?",
  "Oh oh, le texte est plus grand que 2000 caractères, ce qui est par dessus le maximum qui est permis. *(Longueur présente est {0}, action cancellée)*",
  "Que voulez-vous mettre comme titre?",
  "Oh oh, la longueur du titre est plus grand que 256 caractères! Le maximum permis est 256. *(La longueur présente est {0} caractères, action cancellée.)*",
  "Que voulez-vous mettre comme description?",
  "Aucune paroles disponible",
  "Je n'ai pas pu trouver cet artiste. *Désolé.*",
  "Donnez-moi soit une chanson ou un artiste, sinon je ne peux pas fonctionner avec littéralement rien!",
  "*{0}* par *{1}*",

  "Que voulez-vous comme préfixe pour ce serveur?",
  "Le préfixe est plus qu'un caractère. Tu peux seulement avoir un seul caractère.\n*La longueur du préfixe demandée est de {0}*",
  "Veux-tu mettre `{0}` comme le nouveau préfixe?\nExemple: `{0}help`",
  "Hé, c'est le même prefixe! *(Action cancellée. C'est pas comme si ça changerait quelque chose si elle ne serait pas annulée...)*",
  "Le préfixe du serveur a été changé.",
  "D'accord, action annulée.",
  "J'ai aucune idée ce que ça veut dire. *Action annulée.*",
  "{0}, tu n'as pas les permissions pour faire ça.\n*({1} Action annulée)*",
  "D'accord, la fonction d'inactivité a été désactivée.",
  "D'accord, la fonction d'inactivité a été activée.",
  "Quel mot voulez-vous bannir?",
  "D'accord, ce mot a été débanni.",
  "D'accord, ce mot a été banni.",
  "Quelle chaîne voulez-vous basculer?",
  "Oh oh, je n'ai pas pu obtenir la chaîne que vous voulez. Veuillez réessayer. Si ça persiste, insérez directement l'ID de la chaîne. *Action annulée.*",
  "Oups, je n'ai pas pu obtenir la chaîne que vous voulez. Veuillez réessayer en mentionnant directement la chaîne. *Action annulée.*",
  "Es-tu sûr de vouloir enlever <#{0}> des chaînes inactives?",
  "Es-tu sûr de vouloir ajouter <#{0}> dans les chaînes inactiver?",
  "D'accord, j'ai enlevé <#{0}> des chaînes inactives.",
  "D'accord, j'ai ajouté <#{0}> aux chaînes inactives.",
  "Que voulez-vous mettre come rôle pour ceux qui sont mutés?",
  "Oh oh, je n'ai pas pu obtenir le rôle que vous voulez. Veuillez réessayer. Si ça persiste, insérez directement l'ID du rôle. *Action annulée.*",
  "Oups, je n'ai pas pu obtenir le rôle que vous voulez. Veuillez réessayer en mentionnant directement le rôle. *Action annulée.*",
  "Hé, c'est le même rôle qui était déjà défini! *Action annulée. C'est pas comme si ça changerait quelque chose si elle ne serait pas annulée*",
  "Es-tu sûr de vouloir mettre {0} comme le rôle pour ceux qui sont mutés?",
  "D'accord, {0} est maintenant configuré pour être le rôle.",
  "D'accord, des rapports d'erreur anonymes ne seront plus envoyés automatiquement à l'hôte.",
  "D'accord, des rapports d'erreur anonymes seront envoyés automatiquement à l'hôte.",
  "D'accord, la fonction d'inactivité est désactivée.",
  "D'accord, la fonction d'inactivité est activée.",
  "D'accord, les réactions aux tableflips sont désactivées.",
  "D'accord, les réactions aux tableflips sont activées.",
  "Quelle commande voulez-vous désactiver?",
  "Je n'ai pas pu trouver cette commande. *Action annulée.*",
  "Euh, es-tu *sûr* de vouloir basculer la commande `help`?",
  "D'accord, cette commande est activée.",
  "D'accord, cette commande est désactivée.",
  "Quelle catégorie veux-tu désactiver?",
  "Je n'ai pas pu trouver cette catégorie. *Action annulée.*",
  "D'accord, cette catégorie est activée.",
  "D'accord, cette catégorie est désactivée.",

  "Montant invalide: tu ne peux pas mettre un nombre en dessous de 1! *Action annulée.*",
  "{0}, es-tu sûr de vouloir supprimer {1} messages?",
  "{0}, j'ai supprimé {1} messages.",
  "Je n'ai pas pu trouver de règles pour ce serveur.",
  "{0}, tu n'a pas spécifié une règle valide.",
  "{0}, tu n'a pas spécifié de règles.",
  "Que devrait être la description de la règle?",
  "D'accord, règle ajoutée.",
  "Je n'ai pas pu trouver de règles pour ce serveur.",
  "Cette règle n'existe pas.",
  "Cette règle est maintenant supprimée.",
  "Vraiment..? Après tous mes efforts, c'est comme ça qu'on me traite?",
  "Tu te détestes *autant*?",
  "Cet utilisateur a la permission \"Manage Messages\" (ou plus haut) dans le serveur.",
  "Tu n'as pas spécifié d'utilisateur pour kicker. *Action annulée.*",
  "Tu n'as pas spécifié d'utilsateur à bannir. *Action annulée.*",
  "Oups, il parait qu'il y a plus qu'un discriminateur, ce qui rend ma tâche de trouver cet utilisateur impossible. *Action annulée.*",
  "Oups, il parait que j'ai brisé quelque chose (ou Python devient de moins en moins fiable), et maintenant je ne peux pas trouver l'utilisateur que vous cherchez. *Action annulée.*",
  "Hé, je ne suis pas banni",
  "Ouais, t'es pas banni.",
  "Tu n'as pas spécifié de personnne à débannir. *Action annulée.*",
  "Oh oh, je n'ai pas pu trouver la chaîne que tu voulais. Veuillez réessayer. Si le problème persiste, essayez d'insérer directement l'ID de la chaîne. *Action annulée.*",
  "{0}, tu n'a pas spécifié de chaîne.",

  "Le rôle pour les personnes qui seront mutés n'est pas encore défini, veuillez le définir en utilisant la commande `muted_role`. *Action annulée.*",
  "{0}, calme-toi. Cette personne est déjà mutée.",
  "Oups, le temps que vous avez donné n'est pas valide. *Action annulée.*",
  "Tu ne peux pas mettre le temps du passé, ce n'est pas logique. *Action cancelled.*",
  "Le temps ne peut pas être maintenant. *Action annulée.*",
  "{0}, tu n'a pas spécifié un utilisateur valide. *({1} Action annulée)*",
  "{0}, tu n'a pas spécifié de temps jusqu'à ce que l'utilisateur ne sera plus muté. *({1} Action annulée.)*",
  "Je n'ai pas pu trouver de mutes pour ce serveur. *Action annulée.*",
  "Cet utilisateur ({0}) n'est pas muté.",
  "Ce serveur n'a pas de mutes. *Action annulée.*",
  "L'utilisateur est maintenant démuté.",
  "{0}, tu n'a pas d'utilisateur à démuter. *({1} Action annulée.)*",

  "Tu n'as rien. Pourquoi pas relaxer?",
  "Je voudrais bien ajouter quelque chose à ta liste, mais il faudrait que tu indiques *quoi* ajouter!",
  "D'accord, ajouté.",
  "Je voudrais bien enlever quelque chose de ta liste, mais il faudrait que tu indiques *quoi* enlever!",
  "Tu as besoin de spécifier le **numéro** de l'entrée dans la liste que tu veux enlever!",
  "Cette entrée n'existe pas.",
  "Es-tu sûr de vouloir enlever cette entrée?",
  "D'accord, c'est enlevé.",
  "Je voudrais bien modifier quelque chose dans ta liste, mais il faudrait que tu indiques *quoi* modifier!",
  "Es-tu sûr de vouloir modifier cette entrée?",
  "D'accord, c'est modifié.",
  "Tu n'a pas les permissions pour faire ça.",
  "Tu n'es pas l'auteur de cette note, ce qui veut dire que tu ne peux pas enlever cette note.",

  "C'est inutile d'avertir un Bot.",
  "{0}, tu as oublié de spécifier un utilisateur à avertir.",
  "{0}, tu as oublié de spécifier une raison.",
  "Veuillez mentionner quelqu'un à avertir.",
  "Cet utilisateur n'a pas d'avertissements.",
  "Mauvais avertissement, réessayez.",
  "Voulez-vous enlever cet avertissement?",
  "D'accord, cet avertissement a été enlevé.",
  "Veuillez mentionner quelqu'un pour enlever un avertissement.",
  "Que voulez-vous mettre comme description pour cet avertissement?",
  "Êtes-vous sûr de vouloir modifier l'avertissement comme ça?",
  "D'accord, avertissement modifié."
]
